{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"image": {"name": "image:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/light_photo_regressor_1/conv2d_1_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_8_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_7_1/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "24"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_7_1/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_9_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_8_1/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_8_1/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_10_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_9_1/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_9_1/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_11_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_10_1/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_10_1/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_12_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_11_1/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_11_1/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_13_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_12_1/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_12_1/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_14_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_13_1/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "160"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_13_1/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_15_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/global_average_pooling2d_1_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/dense_1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/dense_1_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/log_restore_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/log_restore_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "image", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/re_lu_8_1/Relu", "op": "_FusedConv2D", "input": ["image", "StatefulPartitionedCall/light_photo_regressor_1/conv2d_1_1/convolution/merged_input", "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_8_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_7_1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/light_photo_regressor_1/re_lu_8_1/Relu", "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_7_1/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/re_lu_9_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_7_1/separable_conv2d/depthwise", "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_7_1/separable_conv2d/merged_input", "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_9_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_8_1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/light_photo_regressor_1/re_lu_9_1/Relu", "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_8_1/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/re_lu_10_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_8_1/separable_conv2d/depthwise", "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_8_1/separable_conv2d/merged_input", "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_10_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_9_1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/light_photo_regressor_1/re_lu_10_1/Relu", "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_9_1/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/re_lu_11_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_9_1/separable_conv2d/depthwise", "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_9_1/separable_conv2d/merged_input", "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_11_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_10_1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/light_photo_regressor_1/re_lu_11_1/Relu", "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_10_1/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/re_lu_12_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_10_1/separable_conv2d/depthwise", "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_10_1/separable_conv2d/merged_input", "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_12_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_11_1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/light_photo_regressor_1/re_lu_12_1/Relu", "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_11_1/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/re_lu_13_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_11_1/separable_conv2d/depthwise", "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_11_1/separable_conv2d/merged_input", "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_13_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_12_1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/light_photo_regressor_1/re_lu_13_1/Relu", "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_12_1/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/re_lu_14_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_12_1/separable_conv2d/depthwise", "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_12_1/separable_conv2d/merged_input", "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_14_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_13_1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/light_photo_regressor_1/re_lu_14_1/Relu", "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_13_1/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/re_lu_15_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_13_1/separable_conv2d/depthwise", "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_13_1/separable_conv2d/merged_input", "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_15_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/global_average_pooling2d_1_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/light_photo_regressor_1/re_lu_15_1/Relu", "StatefulPartitionedCall/light_photo_regressor_1/global_average_pooling2d_1_1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/dense_1_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/light_photo_regressor_1/global_average_pooling2d_1_1/Mean", "StatefulPartitionedCall/light_photo_regressor_1/dense_1_1/Cast/ReadVariableOp", "StatefulPartitionedCall/light_photo_regressor_1/dense_1_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/log_restore_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/light_photo_regressor_1/dense_1_1/Relu", "StatefulPartitionedCall/light_photo_regressor_1/log_restore_1/Cast/ReadVariableOp", "StatefulPartitionedCall/light_photo_regressor_1/log_restore_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/light_photo_regressor_1/log_restore_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/light_photo_regressor_1/conv2d_1_1/convolution/merged_input", "shape": [3, 3, 3, 24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_8_1/batchnorm/sub", "shape": [24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_7_1/separable_conv2d/ReadVariableOp", "shape": [3, 3, 24, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_7_1/separable_conv2d/merged_input", "shape": [1, 1, 24, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_9_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_8_1/separable_conv2d/ReadVariableOp", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_8_1/separable_conv2d/merged_input", "shape": [1, 1, 32, 48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_10_1/batchnorm/sub", "shape": [48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_9_1/separable_conv2d/ReadVariableOp", "shape": [3, 3, 48, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_9_1/separable_conv2d/merged_input", "shape": [1, 1, 48, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_11_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_10_1/separable_conv2d/ReadVariableOp", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_10_1/separable_conv2d/merged_input", "shape": [1, 1, 64, 96], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_12_1/batchnorm/sub", "shape": [96], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_11_1/separable_conv2d/ReadVariableOp", "shape": [3, 3, 96, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_11_1/separable_conv2d/merged_input", "shape": [1, 1, 96, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_13_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_12_1/separable_conv2d/ReadVariableOp", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_12_1/separable_conv2d/merged_input", "shape": [1, 1, 128, 160], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_14_1/batchnorm/sub", "shape": [160], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_13_1/separable_conv2d/ReadVariableOp", "shape": [3, 3, 160, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/separable_conv2d_13_1/separable_conv2d/merged_input", "shape": [1, 1, 160, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/batch_normalization_15_1/batchnorm/sub", "shape": [192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/global_average_pooling2d_1_1/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/dense_1_1/Cast/ReadVariableOp", "shape": [192, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/dense_1_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/log_restore_1/Cast/ReadVariableOp", "shape": [128, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/light_photo_regressor_1/log_restore_1/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}]}]}